Tekla Open API Reference for Tekla Structures 2025
CannotSetAttributeForPluginDueToIncorrectTypeException Constructor
 Creates a new CannotSetAttributeForPluginDueToIncorrectTypeException instance.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public CannotSetAttributeForPluginDueToIncorrectTypeException(
	Type ExpectedType,
	Type GivenType
)
Public Sub New (
	ExpectedType As Type,
	GivenType As Type
)
Parameters
ExpectedType
Type: System.Type
The expected type.
GivenType
Type: System.Type
The given type.
See Also
Reference
CannotSetAttributeForPluginDueToIncorrectTypeException Class
Tekla.Structures.Drawing Namespace